VV_cases/V3_array/templates/base_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// V3: pimpleFoam, 2-D array, Pt/D=2.667, symmetryPlane top/bottom
// Re=100: U_in = 0.1263 m/s

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.1263 0 0);

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform (0.1263 0 0);
    }
    outlet
    {
        type        zeroGradient;
    }
    // symmetryPlane — models midplane to next tube, NOT a no-slip wall
    top
    {
        type        symmetryPlane;
    }
    bottom
    {
        type        symmetryPlane;
    }
    cylinder
    {
        type        noSlip;
    }
    front
    {
        type        empty;
    }
    back
    {
        type        empty;
    }
}
