VV_cases/V3_array/templates/base_case/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// V3: pimpleFoam incompressible — kinematic pressure [m^2/s^2]

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet   { type zeroGradient; }
    outlet  { type fixedValue; value uniform 0; }
    top     { type symmetryPlane; }
    bottom  { type symmetryPlane; }
    cylinder{ type zeroGradient; }
    front   { type empty; }
    back    { type empty; }
}
