VV_cases/V3_array/templates/base_case/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// pimpleFoam — V1 and V3

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }
    pFinal
    {
        $p;
        relTol          0;
        tolerance       1e-8;
    }
    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
    UFinal
    {
        $U;
        relTol          0;
        tolerance       1e-9;
    }
}

PIMPLE
{
    nOuterCorrectors        2;
    nCorrectors             2;
    nNonOrthogonalCorrectors 1;
    pRefCell                0;
    pRefValue               0;

    residualControl
    {
        U   1e-5;
        p   1e-5;
    }
}

relaxationFactors
{
    equations
    {
        U       0.9;
        UFinal  1.0;
    }
}
